In [1]:
import pandas as pd # Pandas kutuphanesini import ediyoruz

In [2]:
# Ardindan, bir DataFrame olusturuyoruz.
# Bu dataframe'i olusturmak icin bir veri seti kullaniyorum.
# Chocolate Sales.csv adinda bir veri setini kullanacam ve dataframe olarak okuyacagim.
df = pd.read_csv("Chocolate Sales.csv")

In [3]:
# Veri setimin basarili bir sekilde okunup okunmadigini kontrol etmek icin
# ilk 5 satirini yazdiriyorum.
df.head()
# parametre olarak herhangi bir sayi da verebilirim. Varsayilan olarak 5 satir yazdirir.
# df.head(10) gibi

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [ ]:
# Veri setindeki sutunlarin adi, tipi, null olup olmadigi ve bellek kullanimi hakkinda bilgi almak icin
# info() fonksiyonunu kullanabilirim.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   object
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: int64(1), object(5)
memory usage: 51.4+ KB

In [6]:
# Veri setindeki null degerleri kontrol etmek icin
# isnull() fonksiyonunu kullanabilirim.
df.isnull().sum()
# Eger veri setinde null deger varsa, bu degerlerin sayisini yazdirir.

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [ ]:
# Veri setimin satir ve sutun sayisini ogrenmek icin
# shape ozelligini kullanabilirim.
df.shape
# shape ozelligi, bir tuple dondurur. Ilk eleman satir sayisini, ikinci eleman sutun sayisini verir.

(1094, 6)

In [ ]:
df_copy = df.copy() # Veri setini kopyalayarak df_copy adinda yeni bir dataframe olusturuyorum.

In [27]:
df.loc[0] # Veri setindeki ilk satiri yazdirir.

Sales Person      Jehu Rudeforth
Country                       UK
Product          Mint Chip Choco
Date                   04-Jan-22
Amount                   $5,320
Boxes Shipped                180
Name: 0, dtype: object

In [28]:
df.loc[0:5] # Veri setindeki ilk 5 satiri yazdirir.

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",38

In [29]:
df.loc[0:5, "Product"] # Veri setindeki ilk 5 satirin Product sutununu yazdirir.

0        Mint Chip Choco
1          85% Dark Bars
2    Peanut Butter Cubes
3    Peanut Butter Cubes
4    Peanut Butter Cubes
5     Smooth Sliky Salty
Name: Product, dtype: object

In [30]:
df.loc[0:5, ["Product", "Sales Person"]] # Veri setindeki ilk 5 satirin Product ve Sales sutunlarini yazdirir.

               Product    Sales Person
0      Mint Chip Choco  Jehu Rudeforth
1        85% Dark Bars     Van Tuxwell
2  Peanut Butter Cubes    Gigi Bohling
3  Peanut Butter Cubes    Jan Morforth
4  Peanut Butter Cubes  Jehu Rudeforth
5   Smooth Sliky Salty     Van Tuxwell

In [31]:
df.iloc[0:5, 0:2] # Veri setindeki ilk 5 satirin ilk 2 sutununu yazdirir.

     Sales Person    Country
0  Jehu Rudeforth         UK
1     Van Tuxwell      India
2    Gigi Bohling      India
3    Jan Morforth  Australia
4  Jehu Rudeforth         UK

In [32]:
df.iloc[500:, 3:4] # Veri setindeki 500. satirdan sonraki satirlarin 3. sutununu yazdirir.

           Date
500   14-Apr-22
501   07-Jul-22
502   24-Aug-22
503   24-Feb-22
504   09-May-22
...         ...
1089  17-May-22
1090  07-Jun-22
1091  26-Jul-22
1092  28-Jul-22
1093  23-May-22

[594 rows x 1 columns]

In [ ]:
# Veri setinde Country alaninin sadece India degerlerini almak icin
# query() fonksiyonunu kullanabilirim.
# query() fonksiyonu, verilen sorguya gore filtreleme yapar.
india_data = df.query("Country == 'India'")
# query() fonksiyonu icine yazdigim sorguya gore filtreleme yapar.

In [9]:
# Country = India olan filterelenmis verinin son 5 satirini yazdiriyorum.
india_data.tail()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1075,Roddy Speechley,India,Spicy Special Slims,22-Mar-22,"$10,647",173
1084,Roddy Speechley,India,50% Dark Bites,14-Mar-22,"$8,337",12
1087,Beverie Moffet,India,Almond Choco,24-May-22,"$3,066",96
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [ ]:
# Verileri Sales Person'a gore gruplamak icin
# groupby() fonksiyonunu kullanabilirim.
grouped_data = df.groupby("Sales Person")["Country"].count()
# groupby() fonksiyonu ile Sales Person sutununa gore gruplama yapar.
# count() fonksiyonu ile degerlerin sayisini alir.
grouped_data.head()

Sales Person
Andria Kimpton    39
Barr Faughny      43
Beverie Moffet    50
Brien Boise       53
Camilla Castle    32
Name: Country, dtype: int64

In [15]:
# Veri setindeki bir sutunun unique degerlerini almak icin
# unique() fonksiyonunu kullanabilirim.
unique_countries = df["Country"].unique()
# Country sutunundaki unique degerleri alir.
unique_countries

array(['UK', 'India', 'Australia', 'New Zealand', 'USA', 'Canada'],
      dtype=object)

In [16]:
# Veri setindeki duplicate degerleri kontrol etmek icin
# duplicated() fonksiyonunu kullanabilirim.
duplicates = df.duplicated()
# duplicate deger varsa True, yoksa False doner.
duplicates

0       False
1       False
2       False
3       False
4       False
        ...
1089    False
1090    False
1091    False
1092    False
1093    False
Length: 1094, dtype: bool

In [ ]:
# DataFrame'i belirtilen birden fazla sütuna göre sıralar.
# columns: Sıralanacak sütunlar listesi.
# ascending: Boolean veya boolean listesi. Varsayılan True.
sorted_df = df.sort_values(by=["Country", "Sales Person"], ascending=[True, False])
sorted_df.head()
# 32. satirdan baslatti, yani Country sutununa gore artan, Sales Person sutununa gore azalan
# sekilde siralama yapar.

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
32,Wilone O'Kielt,Australia,Manuka Honey Choco,11-May-22,"$4,284",94
65,Wilone O'Kielt,Australia,Caramel Stuffed Bars,14-Apr-22,"$2,030",11
93,Wilone O'Kielt,Australia,Organic Choco Syrup,07-Jul-22,"$1,743",111
114,Wilone O'Kielt,Australia,Drinking Coco,06-Apr-22,$623,283
192,Wilone O'Kielt,Australia,After Nines,27-May-22,"$3,325",26

In [18]:
# DataFrame'deki sütun adlarını değiştirmek için
# rename() fonksiyonunu kullanabilirim.
# rename() fonksiyonu ile sütun adlarını değiştirir.
# columns parametresi ile sütun adlarını değiştirir.
df_renamed = df.rename(columns={"Country": "Ulke", "Sales Person": "Satis Elemani"})
df_renamed.head()

,Satis Elemani,Ulke,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [19]:
# Iki DataFrame'i birlestirmek icin
# concat() fonksiyonunu kullanabilirim.
# concat() fonksiyonu ile iki DataFrame'i birlestirir.
# axis parametresi ile birlestirme yonunu belirler.
# axis=0 ise satir bazli birlestirme yapar.
# axis=1 ise sutun bazli birlestirme yapar.
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df2 = pd.DataFrame({"A": [4, 5, 6], "B": [7, 8, 9]})
concatenated_df = pd.concat([df1, df2], axis=0)
concatenated_df

   A  B
0  1  4
1  2  5
2  3  6
0  4  7
1  5  8
2  6  9

In [23]:
# Iki DataFrame'i bir sutun uzerinden birlestirmek icin
# merge() fonksiyonunu kullanabilirim.
# merge() fonksiyonu ile iki DataFrame'i birlestirir.
# on parametresi ile birlestirme yapilacak sutunu belirler.
df1 = pd.DataFrame({"A": [1, 2, 3],"B": [4, 5, 6]})
df2 = pd.DataFrame({"A": [2, 3, 4],"C": [7, 8, 9]})
merged_df = pd.merge(df1, df2, on="A", how="inner")
merged_df

   A  B  C
0  2  5  7
1  3  6  8